{"name":"Lei Zhu","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Lei Zhu 朱磊","headerTaglineThree":"Seeking opportunites as SDE","headerTaglineFour":" Currently based in Champaign, IL, US","showCursor":false,"showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/Vincent-Zhul"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/lei-zhu-0a760728b/"},{"id":"5","title":"Email","link":"mailto:zhulei010414@gmail.com"}],"projects":[{"id":"1","title":"Intelligent Profile","description":"Java Full-stack Development","imageSrc":"https://raw.githubusercontent.com/Vincent-Zhul/personal-react-portfolio/main/public/images/intelligentProfile.webp","url":"https://drive.google.com/file/d/1_HI_OadrFMuUl8FoAkNq_JDWYt40FQdc/view?usp=sharing"},{"id":"2","title":"Scientific Translation Practice System","description":"Develop and Design Back-end System and UI","imageSrc":"https://images.unsplash.com/photo-1605153864431-a2795a1b2f95?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxjb2xsZWN0aW9uLXBhZ2V8MXwyNTY3ODl8fGVufDB8fHw%3D&auto=format&fit=crop&w=400&q=60","url":"https://drive.google.com/file/d/1_HI_OadrFMuUl8FoAkNq_JDWYt40FQdc/view?usp=sharing"},{"id":"3","title":"JD Comment Sentiment Analysis","description":"sentiment analysis system with LSTM algorithm","imageSrc":"https://images.unsplash.com/photo-1504083898675-c896ecdae86e?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8MjJ8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"https://drive.google.com/file/d/1_HI_OadrFMuUl8FoAkNq_JDWYt40FQdc/view?usp=sharing"},{"id":"4","title":"Stock Prediction with Sentiment Analysis","description":"sentiment analysis with NLTK and Spacy","imageSrc":"https://images.unsplash.com/photo-1492171983775-a51717616c0d?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8NjB8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"https://drive.google.com/file/d/1_HI_OadrFMuUl8FoAkNq_JDWYt40FQdc/view?usp=sharing"}],"services":[],"aboutpara":"🙋 Hey there! I'm Lei Zhu, a recent graduate with a Bachelor of Engineering in Computer Science and Technology 💻 from University of Electronic Science and Technology of China (UESTC) 电子科技大学 and pursuing my Master's degree in Information Science at UIUC. Throughout my academic and professional journey, I have passionately pursued opportunities to expand my expertise in software development 🛠️ and data analysis 📊, culminating in a series of internships 🧑‍💻 and projects that have significantly honed my skills and prepared me for the challenges of the tech industry. My adventure in the field of technology began shortly after my undergraduate studies at UESTC. The solid foundation I gain from there equipped me with a deep understanding of data structures, algorithms 🧮, and software engineering principles, setting the stage for my future endeavors. In the summer of 2021, I embarked on an enriching internship with China Mingsheng Banking Corp. Ltd in Chengdu, China, as a Financial Data Analyst 🏦. Here, I developed a data analysis system leveraging Python 🐍 and R to enhance loan processing and credit risk assessment. This system utilized advanced machine learning models, including Random Forest 🌳 and Logistic Regression, achieving an impressive 95% accuracy rate in assessing creditworthiness. This experience not only sharpened my analytical skills but also deepened my appreciation for the impactful integration of technology and finance. My journey continued at Susallwave in Shenzhen, China, where I served as a Software Development Intern 💼. During this time, I was instrumental in developing a web-based tool for efficient PDF file interaction, employing Java Spring Boot and React ⚛️. This tool significantly improved operational efficiency, demonstrating my ability to blend frontend and backend development to create cohesive and user-friendly applications. The pinnacle of my internships was my role as a Software Engineer Intern at DiDi Chuxing in Beijing, China. Here, I built a real-time system for driver and insurance data collection, integrating Apache Kafka 📈 for reliable data transmission and utilizing Java ☕️ and Spring Boot. This project not only reduced driver insurance costs by 25% but also enhanced driver retention rates, showcasing my capacity to deliver solutions that have a tangible impact on business outcomes. Parallel to my internships, I engaged in several projects that further exemplified my technical prowess and problem-solving capabilities. Notably, the Intelligent Profile project, a full-stack web application reminiscent of LinkedIn, underscored my proficiency in Java, Spring Boot, MySQL, and AWS 🌐. This project, along with others like the Scientific Translation Practice System and JD Comment Sentiment Analysis, underscore my versatility and adeptness across a broad spectrum of technologies and frameworks, including Python, TensorFlow, and MongoDB 📚.\n Welcome to my website 🌟, where I share my journey, experiences, and passion for all things. Let's connect and explore the exciting world of science and engineering together! 🌍","resume":{"tagline":"👋 I'm a full-stack software engineer.","description":"Specializing in Java, Python, and web development technologies, I've developed real-time systems, web applications, and data analysis tools, significantly improving operational efficiency and decision-making processes. With experience in machine learning, database management, and cloud services, I am driven to contribute to and excel in the tech industry, constantly seeking new challenges and opportunities for growth.","experiences":[{"id":"1","dates":"July 2022 - January 2023","type":"Internship","position":"Software Engineer Intern","bullets":"Built a real-time system for accurate driver and insurance data, integrated with internal databases, and implemented a streamlined RESTful API for consumer team access. - Spearheaded the development of a Java and SpringBoot based microservice to enhance granularity and accuracy in driver and insurance claim information.  - Integrated JDBC and implemented connection pooling for efficient database management, along with robust logging mechanisms. - Engineered APIs for real-time data collection from drivers' mobile devices, including GPS and driving behavior data, and designed the system to efficiently process and manage around 5 million records daily.  - Implemented Apache Kafka to establish a realtime data transmission pipeline between microservices and delivered a well-documented RESTful API for downstream teams. - Utilized rigorous unit and integration testing methodologies to ensure and maintain high standards of code quality. - Implemented Git for version control and Jenkins for automated CI/CD, enhancing code management and ensuring efficient software delivery. - Played a pivotal role in achieving a 25% reduction in driver insurance costs, a 37% decrease in the claim rate, and a boost in driver retention rates from 85.2% to 92.7%."},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"February 2022 - July 2022","type":"Internship","position":"Software Development Intern","bullets":"Developed a web-based tool for PDF file interaction, enabling users to search, edit, and navigate efficiently. This tool featured user-friendly content extraction and display, supported by a robust authentication and authorization system. - Built the frontend using React and Redux, integrated with Material-UI for advanced styling and layout. On the backend, employed Java Spring Boot and established seamless RESTful API communication using Axios in React. - Utilized MongoDB for consistent and unified data storage, ensuring data integrity across the platform. - Designed a three-part user interface comprising field selection, data editing, and PDF viewing, facilitating a seamless and intuitive user experience and streamlining navigation across various data display and editing interfaces. - Ensured secure access through VPN/local network implementation and robust user identity verification via JWT-based authentication. - Implemented role-based access control (RBAC) for differentiated experiences between administrative and regular users, enhancing platform security and usability. - Developed an algorithm in Java and Spring Boot for the automated extraction and indexing of paragraphs from PDFs, significantly boosting data processing efficiency. - Enabled text selection and incorporated guidelines for external OCR tools to handle non-selectable PDFs, adding flexibility to user data input methods. - Achieved considerable improvements in operational efficiency, with a 60% increase in data extraction efficiency and a 35% enhancement in user data cleaning efficiency, contributing to the overall effectiveness of the platform."},{"id":"dc94a348-5900-4c53-b7ca-fccde91f3fcd","dates":"July 2021 - October 2021","type":"Internship","position":"Financial Data Analyst","bullets":"Developed a data analysis system to enhance loan processing and credit risk assessment in the bank credit department, utilizing Python with Pandas, NumPy, Matplotlib, and Seaborn for data manipulation and visualization. This facilitated effective analysis of loan applicants and decision-making support. - Engineered machine learning models, including a Random Forest classifier and Logistic Regression using scikit-learn and GridSearchCV in Python, achieving a 95% accuracy rate in assessing creditworthiness and identifying risk factors. - Conducted statistical analysis and forecasting in R with ggplot2, dplyr, tidyverse, and ARIMA, providing insights into loan demand and default rates, aiding strategic bank planning and risk management. - Integrated with the bank's databases using Python's SQLAlchemy and R's dbplyr, ensuring seamless data preprocessing and accuracy in predictions."}],"education":{"universityName":"University of Illinois at Urbana-Champaign","universityDate":"Aug 2023 - May 2025","universityPara":"Master of Science in Information Science / Information Management"},"languages":["Java","Python","C/C++","Javascript","CSS","HTML5","C#","SQL","R","Swift","GraphQL"],"frameworks":["React","Typescript","NodeJs","Springboot","Angular","Redux","Material-UI",".NET"],"others":["AWS","GCP","NoSQL","ETL","Git","NLP","HDFS","Kafka","Jenkins","CI/CD","Docker"]}}
